import pytest

def zad10(a, b, c):
    from sys import argv
    import math
    """
                Введите массив чисел и функция возвратит сумму всех положительных значений. Если массив пустой, то сумма равна 0.
                >>> zad10(2, 7, 2)
                'Дискриминант больше 0 \\nx1=  12.744562646538029 \\nx2=  -1.2554373534619714'
                >>> zad10(2, 2, 1)
                'Нет корней'
    """
    _, a, b, c = argv

    a = int(a)
    b = int(b)
    c = int(c)

    di = b ** 2 - 4 * a * c

    if di == 0:
        x = -b / 2 * a
        print("Дискриминант равен 0", '\n', "x= ", x)
    elif di > 0:
        x_1 = +b + math.sqrt(di) / 2 * a
        x_2 = -b + math.sqrt(di) / 2 * a
        print("Дискриминант больше 0", '\n', "x1= ", x_1, '\n', "x2= ", x_2)
    else:
        print("Нет корней")

def test_zad10():
    assert zad10(2, 7, 2) == 'Дискриминант больше 0 \nx1=  12.744562646538029 \nx2=  -1.2554373534619714'
    assert zad10(2, 2, 1) == 'Нет корней'


if __name__ == "__main__":
    zad10(2, 7, 2)


